Revit 2024 API
MEPCurveType Class
 The base type class for MEP curves, such as ducts, pipes, cable trays and conduits.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class MEPCurveType : HostObjAttributes
Visual Basic
Public Class MEPCurveType _
	Inherits HostObjAttributes
Visual C++
public ref class MEPCurveType : public HostObjAttributes
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.HostObjAttributes
 Autodesk.Revit.DB.MEPCurveType
 Autodesk.Revit.DB.Electrical.CableTrayType
 Autodesk.Revit.DB.Electrical.ConduitType
 Autodesk.Revit.DB.Mechanical.DuctType
 Autodesk.Revit.DB.Mechanical.FlexDuctType
 Autodesk.Revit.DB.Plumbing.FlexPipeType
 Autodesk.Revit.DB.Plumbing.PipeType
See Also
MEPCurveType Members
Autodesk.Revit.DB Namespace